benchmark/20200515-1034/tsung.xml
<?xml version="1.0"?><tsung loglevel="info">
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="60000"/>
  </clients>

  <servers>
    <server host="localhost" port="3334" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="300" unit="second">
      <users maxnumber="60000" arrivalrate="500" unit="second"/>
    </arrivalphase>
  </load>

  <options>
    <option name="ports_range" min="1025" max="65535"/>
  </options>

  <sessions>
    <session probability="100" name="websocket" type="ts_websocket">
      <request>
        <websocket type="connect" path="/cable"/>
      </request>

      <for var="i" from="1" to="1000" incr="1">
        <thinktime value="wait_bidi"/>
      </for>
    </session>
  </sessions>
</tsung>